-- phpMyAdmin SQL Dump
-- version 4.8.5
-- https://www.phpmyadmin.net/
--
-- 主机： localhost
-- 生成日期： 2025-07-06 18:49:02
-- 服务器版本： 5.7.26
-- PHP 版本： 7.3.4

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
SET AUTOCOMMIT = 0;
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- 数据库： `sea_book`
--

-- --------------------------------------------------------

--
-- 表的结构 `books`
--

CREATE TABLE `books` (
  `bookid` varchar(100) NOT NULL COMMENT '编号',
  `bookname` varchar(100) NOT NULL COMMENT '名字',
  `writer` varchar(100) NOT NULL COMMENT '作者',
  `price` varchar(100) NOT NULL COMMENT '价格',
  `type` varchar(100) NOT NULL COMMENT '类型',
  `floor` varchar(100) NOT NULL COMMENT '位置',
  `condi` varchar(255) NOT NULL COMMENT '是否借还'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `books`
--

INSERT INTO `books` (`bookid`, `bookname`, `writer`, `price`, `type`, `floor`, `condi`) VALUES
('000002', '《三体》', '刘慈欣', '41.95', '科幻', 'A区142书架三层', '否'),
('000003', '《三国演义》', '罗贯中', '56.00', '名著', 'B区120书架三层', '否'),
('000004', '《Java web》', '黑马程序员', '59.80', '学习', 'B区130书架三层', '否'),
('000005', '《网页设计》', '黑马程序员', '52.00', '学习', 'B区130书架三层', '否'),
('000006', '《射雕英雄传》', '金庸', '47.70', '武侠', 'A区142书架三层', '是'),
('000007', '《大理寺日志》', 'RC', '35.00', '漫画', 'A区141书架三层', '是'),
('000008', '《吾皇巴扎黑》', '白茶', '19.79', '漫画', 'A区141书架三层', '是'),
('000009', '《解忧杂货店》', '东野圭吾', '29.80', '小说', 'A区142书架三层', '否'),
('000010', '《云边有个小卖部》', '张嘉佳', '33.60', '文学', 'B区120书架二层', '否'),
('000011', '《活着》', '余华', '22.51', '名著', 'B区130书架三层', '否'),
('000012', '《红楼梦》', '曹雪芹', '45.23', '名著', '三楼141书架三层', '否'),
('000013', '《西游记》', '吴承恩', '27.00', '名著', '三楼130书架三层', '否'),
('000014', '《UI设计》', '黑马程序员', '56.82', '学习', '三楼120书架二层', '否'),
('000015', '《Python》', '黑马程序员', '56.82', '学习', '三楼141书架三层', '否'),
('000016', '《流浪地球》', '刘慈欣', '30.20', '科幻', '三楼130书架三层', '否'),
('000017', '《寻找前世之旅》', 'MJ', '50.50', '漫画', '三楼120书架二层', '否'),
('000018', '《人间失格》', '太宰治', '23.40', '小说', '三楼141书架三层', '否'),
('000019', '《浮生物语》', '娑罗双树', '49.80', '小说', '三楼120书架二层', '否'),
('000020', '《哑舍》', '玄色', '29.88', '小说', '三楼130书架三层', '否'),
('000021', '《夏目友人帐》', '玉响之家', '11.50', '漫画', '三楼120书架二层', '否'),
('000022', '《哆啦A梦》', '不二雄', '205.00', '漫画', '三楼120书架二层', '否'),
('000023', '《摆渡人》', '麦克福尔', '29.00', '名著', '三楼130书架三层', '否'),
('000024', '《数据库》', '黑马程序员', '45.00', '学习', '三楼141书架三层', '否'),
('000025', '《妖猫传》', '梦枕貓', '35.00', '小说', '三楼120书架二层', '是'),
('000026', '《哈利·波特与火焰杯》', 'JK罗琳', '50.80', '儿童读物', '四楼123书架三层', '否'),
('000027', '《哈利·波特与阿兹卡班的囚徒》', 'JK罗琳', '50.8', '儿童读物', '四楼123书架三层', '否'),
('000028', '《厌女》', '上野千鹤子', '45.8', '文学', 'C区001书架1层', '否');

-- --------------------------------------------------------

--
-- 表的结构 `borrowbook`
--

CREATE TABLE `borrowbook` (
  `bookid` varchar(100) NOT NULL,
  `bookname` varchar(100) NOT NULL,
  `username` varchar(100) NOT NULL,
  `begintime` varchar(100) DEFAULT NULL,
  `endtime` varchar(100) DEFAULT NULL COMMENT '还书日期',
  `condi` varchar(100) NOT NULL COMMENT '是否归还'
) ENGINE=InnoDB DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `borrowbook`
--

INSERT INTO `borrowbook` (`bookid`, `bookname`, `username`, `begintime`, `endtime`, `condi`) VALUES
('000001', '《百妖谱》', 'sea', '2022年11月29日', '2022年12月10日', '是'),
('000006', '《射雕英雄传》', 'sky', '2022年11月30日', '2022年12月10日', '否'),
('000007', '《大理寺日志》', 'sky', '2022年11月30日', '2022年12月10日', '否'),
('000011', '《活着》', 'sea', '2022年11月02日', '2022年12月10日', '是'),
('000021', '《夏目友人帐》', 'sky', '2022年11月03日', '2022年12月10日', '是'),
('000025', '《妖猫传》', 'sea', '2022年12月01日', '2022年12月10日', '否'),
('000001', '《百妖谱》', 'sky', '2022年', '2022年', '是'),
('000008', '《吾皇巴扎黑》', 'sea', '2022年12月1日', '2022年12月3日', '否'),
('000001', '《百妖谱》', 'sea', '2022年', '2022年', '是'),
('000001', '《百妖谱》', 'sa', '2023-12-23', '2024-01-23', '是'),
('000002', '《三体》', 'sa', '2023-12-23', '2024-01-23', '是'),
('000003', '《三国演义》', '想', '2023-12-23', '2024-02-23', '是'),
('000001', '《百妖谱》', '秦', '2023-12-23', '2024-02-23', '是'),
('000002', '《三体》', 'sa', '2023-12-25', '2024-01-23', '是');

-- --------------------------------------------------------

--
-- 表的结构 `users`
--

CREATE TABLE `users` (
  `username` char(100) NOT NULL,
  `password` char(100) NOT NULL
) ENGINE=MyISAM DEFAULT CHARSET=utf8;

--
-- 转存表中的数据 `users`
--

INSERT INTO `users` (`username`, `password`) VALUES
('admin', '123456'),
('grass', '123456'),
('sea', '123456'),
('sky', '123456'),
('water', '123456'),
('1', '123456');

--
-- 转储表的索引
--

--
-- 表的索引 `books`
--
ALTER TABLE `books`
  ADD PRIMARY KEY (`bookid`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
